Revit 2024 API
SynchronizeWithCentralOptions Class
 Options to control behavior of synchronization with central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class SynchronizeWithCentralOptions : IDisposable
Visual Basic
Public Class SynchronizeWithCentralOptions _
	Implements IDisposable
Visual C++
public ref class SynchronizeWithCentralOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SynchronizeWithCentralOptions
See Also
SynchronizeWithCentralOptions Members
Autodesk.Revit.DB Namespace